Table of Contents
 Class Polygon2D
Namespace
IdeaRS.OpenModel.Geometry2D
Assembly
IdeaRS.OpenModel.dll
Represents a polygon in two-dimensional space.
[OpenModelClass("CI.Geometry2D.Polygon2D,CI.Geometry2D")]
public class Polygon2D : OpenObject
Inheritance
object
OpenObject
Polygon2D
Derived
TemperatureCurve2D
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 Polygon2D()
Constructor
public Polygon2D()
Properties
 Points
List of polygon points
public List<Point2D> Points { get; set; }
Property Value
List<Point2D>
 Edit this page